Revit 2027 API
PointLoad.IsValidHostId Method
 Indicates if the provided host id can host point loads.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidHostId(
	Document doc,
	ElementId hostId
)
Public Shared Function IsValidHostId (
	doc As Document,
	hostId As ElementId
) As Boolean
public:
static bool IsValidHostId(
	Document^ doc,
	ElementId^ hostId
)
static member IsValidHostId :
        doc : Document *
        hostId : ElementId -> bool
Parameters
doc Document
 The document containing both the host and the load.
hostId ElementId
 The id of the analytical element that is about to host a point load.
Return Value
Boolean
 True if a point load can be placed on the input host id.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PointLoad Class
Autodesk.Revit.DB.Structure Namespace